In [1]:
import pandas as pd

In [2]:
friend_dict_list = [
    {'name': 'John', 'age': 25, "job": "studnet"},
    {'name': 'Nate', 'age': 30, "job": "teacher"},
]

In [3]:
df = pd.DataFrame(friend_dict_list)

In [4]:
df.head()

   name  age      job
0  John   25  studnet
1  Nate   30  teacher

In [5]:
df = df[['name', 'age', 'job']]

In [6]:
df.head()

   name  age      job
0  John   25  studnet
1  Nate   30  teacher

In [7]:
from collections import OrderedDict

In [8]:
friend_dict_dict = OrderedDict(
    [
        ('name', ['John', 'Nate']),
        ('age', [25, 30]),
        ('job', ['studnet', 'teacher'])
    ]
)

In [9]:
df = pd.DataFrame.from_dict(friend_dict_dict)

In [10]:
df.head()

   name  age      job
0  John   25  studnet
1  Nate   30  teacher

In [11]:
friend_list = [
    ['John', 25, 'studnet'],
    ['Nate', 30, 'teacher'],
]

In [12]:
column_name = ['name', 'age', 'job']

In [13]:
df = pd.DataFrame.from_records(friend_list, columns=column_name)

In [14]:
df.head()

   name  age      job
0  John   25  studnet
1  Nate   30  teacher